RIET/src/Reports/РегистрРасчетСтоимостиОстатковНЗП/РегистрРасчетСтоимостиОстатковНЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РегистрРасчетСтоимостиОстатковНЗП</name>
  <comment>(регл)</comment>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
</mdclass:Report>

RIET/src/AccountingRegisters/Налоговый/Налоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Налоговый</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Налоговый</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>ВидУчета</name>
    <type>
      <types>EnumRef.ВидыУчетаПоПБУ18</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорректируемыйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

RIET/src/Enums/ВидыРасходовНУ/ВидыРасходовНУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРасходовНУ</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>МатериальныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>Амортизация</name>
  </enumValues>
  <enumValues>
    <name>ТранспортныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>КомандировочныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ПредставительскиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>РасходыНаРекламуНормируемые</name>
  </enumValues>
  <enumValues>
    <name>РемонтОсновныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ОбязательноеИДобровольноеСтрахованиеИмущества</name>
  </enumValues>
  <enumValues>
    <name>ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников</name>
  </enumValues>
  <enumValues>
    <name>ДобровольноеЛичноеСтрахование</name>
  </enumValues>
  <enumValues>
    <name>ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности</name>
  </enumValues>
  <enumValues>
    <name>НалогиИСборы</name>
  </enumValues>
  <enumValues>
    <name>НИОКР</name>
  </enumValues>
  <enumValues>
    <name>ОсвоениеПриродныхРесурсов</name>
  </enumValues>
  <enumValues>
    <name>АрендаФедеральногоИМуниципальногоИмущества</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>НеУчитываемыеВЦеляхНалогообложения</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/ВидыУчетаПоПБУ18/ВидыУчетаПоПБУ18.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУчетаПоПБУ18</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>НУ</name>
    <comment>Налоговый учет</comment>
  </enumValues>
  <enumValues>
    <name>ПР</name>
    <comment>Учет постоянных разниц</comment>
  </enumValues>
  <enumValues>
    <name>ВР</name>
    <comment>Учет временных разниц</comment>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/ПодразделенияОрганизаций/ПодразделенияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодразделенияОрганизаций</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйОрган</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Location</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПодразделения</name>
    <type>
      <types>EnumRef.ВидПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПФР</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодИМНС</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальныеУсловияПФР</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ТерриториальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПлательщикаПриПеречисленииНалогов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИностраннаяОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКОПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоНаименованиеОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоКодОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <comment>Заполняется в случае, если организация не российская</comment>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПостоянногоМестонахождения</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВСтранеРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИнострОрганизации</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерФСС</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИМНС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОНХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйПредприниматель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислениеАмортизацииОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GeoMarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменЗадействован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКодАбонента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКаталогОтправкиДанныхОтчетности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКаталогПрограммыЭлектроннойПочты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИФНСПолучателя</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЗаказчика</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntity</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>rgsКонтрагент</name>
    <comment>Контрагент</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Reports/РегистрРасчетСтоимостиОстатковНЗП/ObjectModule.bsl
#Если Клиент Тогда
	
Перем НП Экспорт;

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
//
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь) Экспорт

	НачалоПериода = НачалоДня(ДатаНач);
	КонецПериода  = КонецДня(ДатаКон);

	ДокументРезультат.Очистить();

	Макет = ПолучитьМакет("Отчет");

	ОбластьЗаголовок  = Макет.ПолучитьОбласть("Заголовок");

	ОбластьЗаголовок.Параметры.НачалоПериода       = Формат(НачалоПериода, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.КонецПериода        = Формат(КонецПериода, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное;
	ОбластьЗаголовок.Параметры.ИННОрганизации      = "" + Организация.ИНН + " / " + Организация.КПП;
	Если НоменклатурнаяГруппа <> Справочники.НоменклатурныеГруппы.ПустаяСсылка() Тогда
		ОбластьЗаголовок.Параметры.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
	Иначе
		ОбластьЗаголовок.Параметры.НоменклатурнаяГруппа = "По всем";
	КонецЕсли;
	
	Если Подразделение <> Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
		ОбластьЗаголовок.Параметры.Подразделение = Подразделение;
	Иначе
		ОбластьЗаголовок.Параметры.Подразделение = "По всем";
		
	КонецЕсли;

	ДокументРезультат.Вывести(ОбластьЗаголовок);

	// Параметр для показа заголовка
	ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;

	// Когда нужен только заголовок:
	Если ТолькоЗаголовок Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(ВысотаЗаголовка) Тогда
		ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	КонецЕсли;
	
	СписокСчетов = Новый Массив;
		СписокСчетов.Добавить(ПланыСчетов.Налоговый.ПрямыеРасходыОсновногоПроизводства);
		СписокСчетов.Добавить(ПланыСчетов.Налоговый.ПрямыеРасходыВспомогательныхПроизводств);
	

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач",     Новый Граница(НачалоДня(ДатаНач), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаКон",     Новый Граница(КонецДня(ДатаКон),  ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Амортизация", Перечисления.ВидыРасходовНУ.Амортизация);
	Запрос.УстановитьПараметр("ОплатаТруда", Перечисления.ВидыРасходовНУ.ОплатаТруда);
	Запрос.УстановитьПараметр("МатериальныеРасходы", Перечисления.ВидыРасходовНУ.МатериальныеРасходы);
	Запрос.УстановитьПараметр("НалогиИСборы", Перечисления.ВидыРасходовНУ.НалогиИСборы);
	Запрос.УстановитьПараметр("ВидУчета",Перечисления.ВидыУчетаПоПБУ18.НУ);
    Запрос.УстановитьПараметр("Счет",  СписокСчетов);
	Запрос.УстановитьПараметр("ВидСубконто",ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
	Запрос.УстановитьПараметр("ВыбПодразделение",Подразделение);
	Запрос.УстановитьПараметр("ВыбНоменклатурнаяГруппа",НоменклатурнаяГруппа);

	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.Субконто2 КАК НоменклатурнаяГруппа,
	|	СУММА(ВЫБОР КОГДА НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.Субконто3.ВидРасходовНУ <> &Амортизация И НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.Субконто3.ВидРасходовНУ <> &НалогиИСборы И НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.Субконто3.ВидРасходовНУ <> &МатериальныеРасходы И НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.Субконто3.ВидРасходовНУ <> &ОплатаТруда ТОГДА ВЫБОР КОГДА (НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.СуммаОборотДт) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.СуммаОборотДт КОНЕЦ ИНАЧЕ 0 КОНЕЦ) КАК ДругиеРасходы,
	|	СУММА(ВЫБОР КОГДА НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.Субконто3.ВидРасходовНУ = &МатериальныеРасходы ТОГДА ВЫБОР КОГДА (НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.СуммаОборотДт) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.СуммаОборотДт КОНЕЦ ИНАЧЕ 0 КОНЕЦ) КАК МатериальныеРасходы,
	|	СУММА(ВЫБОР КОГДА НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.Субконто3.ВидРасходовНУ = &Амортизация ТОГДА ВЫБОР КОГДА (НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.СуммаОборотДт) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.СуммаОборотДт КОНЕЦ ИНАЧЕ 0 КОНЕЦ) КАК Амортизация,
	|	СУММА(ВЫБОР КОГДА НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.Субконто3.ВидРасходовНУ = &ОплатаТруда ТОГДА ВЫБОР КОГДА (НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.СуммаОборотДт) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.СуммаОборотДт КОНЕЦ ИНАЧЕ 0 КОНЕЦ) КАК ОплатаТруда,
	|	СУММА(ВЫБОР КОГДА НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.Субконто3.ВидРасходовНУ = &НалогиИСборы ТОГДА ВЫБОР КОГДА (НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.СуммаОборотДт) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.СуммаОборотДт КОНЕЦ ИНАЧЕ 0 КОНЕЦ) КАК ЕСН,
	|	СУММА(ВЫБОР КОГДА (НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.СуммаОборотДт) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.СуммаОборотДт КОНЕЦ) КАК СуммаПрямыхРасхдовЗаМесяц,
	|	СУММА(ВЫБОР КОГДА (НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.СуммаНачальныйОстаток) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.СуммаНачальныйОстаток КОНЕЦ) КАК СтоимостьНачальныйОстаток,
	|	СУММА(ВЫБОР КОГДА (НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.СуммаКонечныйОстаток) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.СуммаКонечныйОстаток КОНЕЦ) КАК СтоимостьКонечныйОстаток,
	|	НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.Период КАК Период
	|ИЗ
	|	РегистрБухгалтерии.Налоговый.ОстаткиИОбороты(&ДатаНач,
	|&ДатаКон,
	|Месяц,
	|ДвиженияИГраницыПериода,
	|Счет В (&Счет),
	|,
	|Организация = &Организация И ВидУчета = &ВидУчета";
	
	Если Подразделение <> Справочники.ПодразделенияОрганизаций.ПустаяСсылка() И НоменклатурнаяГруппа <> Справочники.НоменклатурныеГруппы.ПустаяСсылка() Тогда
		Запрос.Текст = Запрос.Текст + " И
		|	Субконто1 В(&ВыбПодразделение) И
		|	Субконто2 В(&ВыбНоменклатурнаяГруппа)";
	ИначеЕсли НоменклатурнаяГруппа <> Справочники.НоменклатурныеГруппы.ПустаяСсылка() Тогда
		Запрос.Текст = Запрос.Текст + " И
		|	Субконто2 В(&ВыбНоменклатурнаяГруппа)";
	ИначеЕсли Подразделение <> Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
		Запрос.Текст = Запрос.Текст + " И
		|	Субконто1 В(&ВыбПодразделение)";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|) КАК НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты
    |
	|СГРУППИРОВАТЬ ПО
	|	НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.Субконто3.ВидРасходовНУ,
	|	НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.Субконто2,
	|	НезавершенноеПроизводствоНалоговыйУчетОстаткиИОбороты.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	НоменклатурнаяГруппа
	|
	|ИТОГИ СУММА(ДругиеРасходы), СУММА(МатериальныеРасходы), СУММА(Амортизация), СУММА(ОплатаТруда), СУММА(ЕСН), СУММА(СуммаПрямыхРасхдовЗаМесяц), СУММА(СтоимостьНачальныйОстаток), СУММА(СтоимостьКонечныйОстаток) ПО
	|	Период,
	|	НоменклатурнаяГруппа";
	Результат = Запрос.Выполнить();

	ОбластьШапкаТаблицы  = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока        = Макет.ПолучитьОбласть("Строка");
	ОбластьИтого         = Макет.ПолучитьОбласть("Итого");
	ОбластьПодвал        = Макет.ПолучитьОбласть("Подвал");

	ДокументРезультат.Вывести(ОбластьШапкаТаблицы);

	ВыборкаПериодов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаПериодов.Следующий() Цикл

		МесяцГод = Формат(ВыборкаПериодов.Период,"ДФ=MMMM.yyyy");
		МесяцГод = СтрЗаменить(МесяцГод,"."," ");

		СуммаПрямыхРасхдовЗаМесяц = ?(ВыборкаПериодов.СуммаПрямыхРасхдовЗаМесяц = NULL, 0, ВыборкаПериодов.СуммаПрямыхРасхдовЗаМесяц);

		ОбластьИтого.Параметры.МесяцГод                          = МесяцГод;
		ОбластьИтого.Параметры.СуммаОстатокНЗПНаНачалоМесяца     = ВыборкаПериодов.СтоимостьНачальныйОстаток;
		ОбластьИтого.Параметры.СуммаМатериальныхРасходовЗаМесяц  = ВыборкаПериодов.МатериальныеРасходы;
		ОбластьИтого.Параметры.СуммаДругихРасходовЗаМесяц        = ВыборкаПериодов.ДругиеРасходы;
		ОбластьИтого.Параметры.СуммаРасходовНаОплатуТрудаЗаМесяц = ВыборкаПериодов.ОплатаТруда;
		ОбластьИтого.Параметры.СуммаЕСНЗаМесяц                   = ВыборкаПериодов.ЕСН;
		ОбластьИтого.Параметры.СуммаАмортизацииЗаМесяц           = ВыборкаПериодов.Амортизация;

		ОбластьИтого.Параметры.СуммаПрямыхРасхдовЗаМесяц         =  СуммаПрямыхРасхдовЗаМесяц;
		ОбластьИтого.Параметры.СуммаПрямыхРасходовНаКонецМесяца  = ВыборкаПериодов.СтоимостьНачальныйОстаток + СуммаПрямыхРасхдовЗаМесяц;
		ОбластьИтого.Параметры.СуммаОстатокНЗПНаКонецМесяца      = ВыборкаПериодов.СтоимостьКонечныйОстаток;
		ОбластьИтого.Параметры.СуммаОтносящаясяКВыпускуПродукции = ВыборкаПериодов.СтоимостьНачальныйОстаток + СуммаПрямыхРасхдовЗаМесяц - ВыборкаПериодов.СтоимостьКонечныйОстаток;

		ДокументРезультат.Вывести(ОбластьИтого);

		ВыборкаСтрок = ВыборкаПериодов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаСтрок.Следующий() Цикл

			СуммаПрямыхРасхдовЗаМесяц = ВыборкаСтрок.СуммаПрямыхРасхдовЗаМесяц;

			ОбластьСтрока.Параметры.МесяцГод                          = МесяцГод;
			ОбластьСтрока.Параметры.ВидНоменклатуры                   = ВыборкаСтрок.НоменклатурнаяГруппа;
			ОбластьСтрока.Параметры.СуммаОстатокНЗПНаНачалоМесяца     = ВыборкаСтрок.СтоимостьНачальныйОстаток;
			ОбластьСтрока.Параметры.СуммаМатериальныхРасходовЗаМесяц  = ВыборкаСтрок.МатериальныеРасходы;
			ОбластьСтрока.Параметры.СуммаРасходовНаОплатуТрудаЗаМесяц = ВыборкаСтрок.ОплатаТруда;
			ОбластьСтрока.Параметры.СуммаЕСНЗаМесяц                   = ВыборкаСтрок.ЕСН;
			ОбластьСтрока.Параметры.СуммаАмортизацииЗаМесяц           = ВыборкаСтрок.Амортизация;
 			ОбластьСтрока.Параметры.СуммаДругихРасходовЗаМесяц        = ВыборкаСтрок.ДругиеРасходы;
			
			ОбластьСтрока.Параметры.СуммаПрямыхРасхдовЗаМесяц         = СуммаПрямыхРасхдовЗаМесяц;
			ОбластьСтрока.Параметры.СуммаПрямыхРасходовНаКонецМесяца  = ВыборкаСтрок.СтоимостьНачальныйОстаток + СуммаПрямыхРасхдовЗаМесяц;
			ОбластьСтрока.Параметры.СуммаОстатокНЗПНаКонецМесяца      = ВыборкаСтрок.СтоимостьКонечныйОстаток ;
			ОбластьСтрока.Параметры.СуммаОтносящаясяКВыпускуПродукции = ВыборкаСтрок.СтоимостьНачальныйОстаток + СуммаПрямыхРасхдовЗаМесяц - ВыборкаСтрок.СтоимостьКонечныйОстаток;

			ДокументРезультат.Вывести(ОбластьСтрока);

		КонецЦикла;

	КонецЦикла;

	СтруктураЛиц = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация, ДатаКон);

	ОбластьПодвал.Параметры.ОтветственныйЗаРегистры = СтруктураЛиц.ОтветственныйЗаРегистры;

	ДокументРезультат.Вывести(ОбластьПодвал);

КонецПроцедуры // СформироватьОтчет

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

НП = Новый НастройкаПериода;

#КонецЕсли
